export default {
  WIP: 'Ещё не готово...',
  languageSelector: {
    title: 'Язык',
  },
  app: {
    title: 'Слово в слове',
  },
  nav: {
    title: 'Действия',
    docs: {
      title: 'Документация',
      caption: 'Сайт quasar.dev',
    },
    createWord: {
      title: 'Добавить',
      caption: 'Создать новое слово',
    },
    about: {
      title: 'Описание',
      caption: 'Страница с информацией',
    },
  },
  wordCard: {
    foundCount: 'Ещё не найдено слов | Найдено {n} слово | Найдено {n} слова | Найдено {n} слов',
    continue: 'Продолжить',
  },
  wordsList: {
    continue: 'Продолжить:',
  },
  wordCreate: {
    title: 'Введите слово',
    description: 'Чем длиннее слово, тем больше новых слов можно составить из его букв.',
    newWordInputLabel: 'Новое слово',
  },
  about: {
    title: 'Описание',
    text: 'Составляйте слова из букв выбранного слова. '
      + 'Например, из слова "фтор" можно составить слова "торф", "рот", "ор", '
      + 'но нельзя составить слово "рост", так как буквы "с" нет в слове "торф".',
    create: 'Создать новое слово',
  },
}
